# Уровень 1: Базовый
# Задача: напишите функцию calculate_area, которая вычисляет площадь прямоугольника.
# Функция должна принимать длину и ширину, а затем возвращать площадь.
# Основная программа должна запрашивать у пользователя длину и ширину,
# а затем выводить результат, используя эту функцию.

def calculate_area(length, width):
    ["Вычисляет площадь прямоугольника по длине и ширине"]
    return length * width
try:
    length = float(input("Введите длину прямоугольника : "))
    width = float(input("Введите ширину прямоугольника  : "))

    if length < 0 or length < 0:
        print("Ошибка длины и ширины должны быть неотрицательными")
    else:
        area = calculate_area(length, width)
        print(f"Площадь прямоугольника : {area}")
except ValueError:
    print("Ошибка введите коректные числа")