# Уровень 1: Базовый
# Задача: напишите программу, которая использует итератор для последовательного перебора строк текста,
#  разделённого символами перевода строки (\n). Программа должна по очереди выводить каждую строку.
#  Если строки закончились, выведите сообщение: «Текст завершён».

text = """Первая строка
Вторая строка
Третья строка"""

lines_interator = iter(text.splitlines())

while True:
    try:
        line = next(lines_interator)
        print(line)
    except StopIteration:
        print("Текст завершен")
        break