# Получаем от пользователя начало конец и шаг
# Уровень 2: Средний
# Задача: напишите программу, которая с помощью итератора перебирает числа в диапазоне с заданным шагом.
#  Пользователь должен указать начало, конец и шаг. Программа должна выводить числа по одному. Если числа закончились,
#  выведите сообщение: «Диапазон завершён».

start = int(input("Введите начало диапазона : "))
end = int(input("Введите конец диапазона : "))
step = int(input("Введите шаг : "))

iterator = iter(range(start, end, step))

while True:
    try:
        num = next(iterator)
        print(num)
    except StopIteration:
        print("Диапазон завершен")
        break