while True:
    # 1 Запрос типа учебного материала
    mterial_type = input("Введите тип учебного материала (книга/видео): ")

    # Проверка что тип не пустой
    if not mterial_type:
        print("Ошибка: тип материала не может быть пустым Введите снова")
        continue
    else:
        break

# 2 Запрос стоимости с проверкой что это полжительнок число
while True:
    try:
        cost_input = input("Введите стоимость материала: ")
        cost = float(cost_input)
        if cost > 0:
            break
        else:
            print("Ошибка: стоимости должна быть положительным чилом Введите снова")
    except ValueError:
        print("Ошибка: неверный ввод Пожайста введите число")

# 3 Запрос категории материала
while True:
    category = input("Введите категорию материала (например, математика, история): ")

    if not category:
        print("Ошибка: категория не может быть пустым Введите снова")
    else:
        break

# 4 Вывод подтверждения об успешном добавлении
print(f"Материал добавлен: тип - {mterial_type}, Стоимость - {cost}, Категория - {category}")
print("\nВсе материалы успешно добавлены")
