# Уровень 2: Средний
#
# Задача: разработайте программу для подсчёта общего количества товаров, поступивших
# на склад за день. Пользователь должен вводить количество каждой партии товара до тех
# пор, пока не введёт число 0, сигнализирующее о конце рабочего дня. Если количество
# товара введено отрицательно или в формате, отличном от числа, программа должна сообщать
# об ошибке и предлагать повторный ввод. В конце работы программа должна вывести общее
# количество принятых товаров.

x = 0
while True:
    try:
        rav = int(input("Введите количество товаров"))
        if rav < 0:
            print("введите еще раз")
            continue

        if rav == 0:
            break

        x += rav

    except ValueError:
        print("Ошибка")

print("количество товаров", x)