# Уровень 2: Средний
#
# Задача: напишите программу, которая позволяет пользователю добавлять
# и удалять фильмы из списка любимых фильмов. Пользователь должен ввести
# команду ‘add’ для добавления фильма или ‘remove’ для его удаления.
# После каждого действия программа должна выводить обновленный список.

film1 = []
while True:
    clik = input("Введите команду add - remove ")
    if clik == "add":
        film = input("Введите фильм")
        if film:
            film1.append(film)
            print("Фильм добавлен")
    elif clik == "remove":
        film = input("удаление : ")
        if film in film1:
            film1.remove(film)
            print("удален")
    elif clik == "exit":
        break
    print("Список фильмов : ", film1)
