# Уровень 3: Продвинутый
#
# Задача: разработайте программу для подсчета среднего количества товаров, поступивших на склад за указанное количество
# дней. Программа должна сначала запрашивать у пользователя количество дней для анализа. Затем для каждого дня должна
# запрашиваться количество товаров, поступивших на склад. В конце программа должна вывести среднее количество товаров,
# поступивших за день. Если ввод данных некорректен (например, введено отрицательное число дней или товаров,
# или нечисловое значение), программа должна сообщать об ошибке и предлагать повторный ввод.
while True:
    try:
        dyn = int(input("Ведите дней"))
        if dyn <= 0:
            print("error")
            continue
        break
    except ValueError:
        print("error")
suma = 0

for d in range(1, dyn +1):
    while True:
        try:
            coli = int(input(f"за день {d} : "))
            if coli < 0:
                print("error")
                continue
            suma += coli
            break
        except ValueError:
            print("error")
x = suma / dyn
print(f"за день :  {x:.2f}")
