# string_utils.py
# Уровень 2: Средний
# Задача: создайте модуль string_utils.py, который содержит функции для работы со строками:
# reverse_string(text) — возвращает перевёрнутую строку. count_vowels(text) — возвращает
# количество гласных букв в строке. is_palindrome(text) — проверяет, является ли строка
# палиндромом (читается одинаково в обоих направлениях). Напишите основную программу,
# которая импортирует этот модуль и предоставляет пользователю выбор функции для работы со строкой.

def reverse_string(text: str) -> str:
    ["Возвращает строку перевернутую в обратном порядке"]
    return text[::-1]

def count_vowels(text: str) -> int:
    [
        "Возвращает количество гласных букв в строке"
        "Учитываются русские и английские гласные регистр не важен"
    ]

    vowels = "аеёищуыэюяАЕЁИОУЫЭЮЯ" + "aeiouAEIOU"
    return sum(1 for char in text if char in vowels)

def is_palindrome(text: str) -> bool:
    [
        "Проверяет является ли строка палиндромом"
        "При проверке игнорируются пробелы знаки препинания и регистр"
        "Оставляются только буквы и цифры"
    ]
    cleaned = "".join(ch.lower() for ch in text if ch.isalnum())
    return cleaned == cleaned[::-1]