# temperature_converter.py
# Уровень 3: Продвинутый
# Задача: создайте модуль temperature_converter.py, который содержит функции:
# celsius_to_fahrenheit(c) — переводит температуру из Цельсия в Фаренгейт.
# fahrenheit_to_celsius(f) — переводит температуру из Фаренгейта в Цельсий.
# kelvin_to_celsius(k) — переводит температуру из Кельвина в Цельсий. Напишите программу,
# которая позволяет пользователю выбрать тип конверсии и вводит температуру для преобразования.

def celsius_to_fahrenheit(c:float) -> float:
    ["Переводит температуру из цельсия в фаренгейт : F = C * 9/5 + 32"]
    return c * 9 / 5 + 32

def fahrenheit_to_celsius(f:float) -> float:
    ["Переводит температуру из фаренгейта в цельсий : C = (F - 32) * 5/9"]
    return (f - 32) * 5/9

def kelvin_to_celsius(k:float) -> float:
    ["Переводит температуру из кельвина в цельсий : c= k - 273.15"]
    return k - 273.15