# Уровень 2: Средний
# Задача: разработайте программу для подсчёта общего количества товаров,
# поступивших на склад за день. Пользователь должен вводить количество каждой партии товара до тех пор,
# пока не введёт число 0, сигнализирующее о конце рабочего дня.
# Если количество товара введено отрицательно или в формате,
# отличном от числа, программа должна сообщать об ошибке и предлагать повторный ввод.
# В конце работы программа должна вывести общее количество принятых товаров.

total_items = 0

print("Вводите количество товаров в каждой партии Введите 0 чтобы завершить учет за день")

while True:
    user_input = input("количество товаров в партии : ")

    try:
        quantity = float(user_input)
    except ValueError:
        print("Ошибка введите число")
        continue

    if quantity == 0:
        break

    if quantity < 0:
        print("Ошибка количество товара не может быть отрицательным")
        continue

    total_items += quantity

print(f"Общее количество товаров поступивших на склад за день : {total_items}")