# Уровень 1: Базовый
# Задача: напишите программу, которая запрашивает у пользователя числа до тех пор,
# пока не будет введено число 0. После завершения ввода, программа должна вывести
# сумму всех введённых положительных чисел.

total = 0

while True:
    try:
        num = float (input("Введите число (0 для завершения) : "))
        if num == 0:
            break

        if num > 0:
            total += num

    except ValueError:
        print("Введите корректное число")

print(f"Сумма всех введенных положительных чисел : {total}")